export const CITY_DISTRICT_MAP: Record<string, string[]> = {
  '台北市': ['中正區', '大同區', '中山區', '松山區', '大安區', '萬華區', '信義區', '士林區', '北投區', '內湖區', '南港區', '文山區'],
  '新北市': ['板橋區', '三重區', '中和區', '永和區', '新莊區', '新店區', '土城區', '蘆洲區', '汐止區', '樹林區', '鶯歌區', '三峽區', '淡水區', '林口區'],
  '桃園市': ['桃園區', '中壢區', '大溪區', '楊梅區', '蘆竹區', '大園區', '龜山區', '八德區', '龍潭區', '平鎮區'],
  '台中市': ['中區', '東區', '南區', '西區', '北區', '北屯區', '西屯區', '南屯區', '太平區', '大里區', '霧峰區', '豐原區'],
  '台南市': ['中西區', '東區', '南區', '北區', '安平區', '安南區', '永康區', '新營區', '鹽水區', '善化區'],
  '高雄市': ['楠梓區', '左營區', '鼓山區', '三民區', '前金區', '新興區', '苓雅區', '前鎮區', '小港區', '鳳山區'],
};
